load-test-result-monolith-no-redis.txt
Load test for the store-products endpoint before adding REDIS
$ hey -n 2000 -c 50 -m GET -T "application/json" http://localhost:8080/store-products

Summary:
  Total:	3.9414 secs
  Slowest:	1.8233 secs
  Fastest:	0.0110 secs
  Average:	0.0744 secs
  Requests/sec:	507.4387


Response time histogram:
  0.011 [1]	|
  0.192 [1954]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.373 [3]	|
  0.555 [3]	|
  0.736 [3]	|
  0.917 [1]	|
  1.098 [1]	|
  1.280 [1]	|
  1.461 [1]	|
  1.642 [1]	|
  1.823 [31]	|■


Latency distribution:
  10% in 0.0168 secs
  25% in 0.0214 secs
  50% in 0.0418 secs
  75% in 0.0595 secs
  90% in 0.0773 secs
  95% in 0.0920 secs
  99% in 1.7797 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0110 secs, 1.8233 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0038 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0014 secs
  resp wait:	0.0739 secs, 0.0109 secs, 1.8096 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0021 secs

Status code distribution:
  [200]	2000 responses