load-test-result-monolith-with-redis.txt
Load test for the store-products endpoint after adding REDIS
$ hey -n 2000 -c 50 -m GET -T "application/json" http://localhost:8080/store-products

Summary:
  Total:	2.5004 secs
  Slowest:	0.7532 secs
  Fastest:	0.0012 secs
  Average:	0.0606 secs
  Requests/sec:	799.8678


Response time histogram:
  0.001 [1]	|
  0.076 [1622]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.152 [262]	|■■■■■■
  0.227 [59]	|■
  0.302 [0]	|
  0.377 [8]	|
  0.452 [12]	|
  0.528 [12]	|
  0.603 [0]	|
  0.678 [1]	|
  0.753 [23]	|■


Latency distribution:
  10% in 0.0144 secs
  25% in 0.0220 secs
  50% in 0.0360 secs
  75% in 0.0564 secs
  90% in 0.1090 secs
  95% in 0.1662 secs
  99% in 0.7032 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.0012 secs, 0.7532 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0038 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0034 secs
  resp wait:	0.0602 secs, 0.0012 secs, 0.7395 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0015 secs

Status code distribution:
  [200]	2000 responses